/*

题目：企业发放的奖金根据利润提成。

利润(I)低于或等于10万元时，奖金可提10%；
利润高于10万元，低于20万元时，低于10万元的部分按10%提成，高于10万元的部分，可提成7.5%；
20万到40万之间时，高于20万元的部分，可提成5%；
40万到60万之间时高于40万元的部分，可提成3%；
60万到100万之间时，高于60万元的部分，可提成1.5%；
高于100万元时，超过100万元的部分按1%提成。
从键盘输入当月利润I，求应发放奖金总数？


*/
#include <stdio.h>


int main(){
	//int n;
	//int s = 0;
	//printf("%s\n", "Please input intrest:");
	//scanf("%d", &n);
	/*if(n < 10){
		s = n * 0.1;
	}
	else if(n < 20){
		s = (n - 10) * 0.075 + 1;
	}
	else if(n < 40){
		s = (n - 20)* 0.05 + 1.75;
	}
	else if(n < 60){
		s = 2.75 + (n-40)*0.03;
	}
	else if(n<100){
		s = 3.35 + (n - 60)*0.015;
	}
	else{
		s = 3.95 + (n - 100)*0.01;
	}
	printf("%d\n", s);*/
	return 0;
}